# Northwind
## Database
We will learn
- how to markdown
- others

**This is a bold text**


This format highlists this 'word' if the word is a database table and i am going to add a line break right here to begin the next sentence on a new line.<br>This format highlists this 'word' if the word is a database table<br>
>I am trying to display a warning text

Here is a view of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="Northwind_ERD.png"  style="width:70%";/>
<br>
<br>
    <em>Figure 1: Northwind database ERD</em>
</div>

## Random Markdown Table

This table is to test my learning of markdown:

| Name | Country |
|----------------------------|------------|
| Ronaldo                       | Angola, Botswana, Comoros, Democratic Republic of Congo, Eswatini, Lesotho, Madagascar, Malawi, Mauritius, Mozambique, Namibia, Seychelles, South Africa, United Republic Tanzania, Zambia, Zimbabwe |
| Messi                        | Algeria, Libya, Mauritania, Morocco, Tunisia |
| Neymar                     | Benin, Burkina Faso, Cabo Verde, Cote dâ€™Ivoire, Gambia, Ghana, Guinea, Guinea-Bissau, Liberia, Mali, Niger, Nigeria, Senegal, Sierra Leone, Togo |
| Not Classified             | Other countries not listed above |

We will use this table when constructing our queries.

In [5]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
# Load the Northwind database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///Northwind.db

'Connected: @Northwind.db'

In [50]:
#Showing all tables present in the Northwind database
%time
%sql SELECT name FROM sqlite_master WHERE type='table';

Wall time: 0 ns
 * sqlite:///Northwind.db
Done.

[('Categories',),
 ('Customers',),
 ('Region',),
 ('Shippers',),
 ('Suppliers',),
 ('Employees',),
 ('EmployeeTerritories',),
 ('OrderDetails',),
 ('Orders',),
 ('Territories',),
 ('Products',)]

In [34]:
%sql SELECT * FROM Orders LIMIT 10;

 * sqlite:///Northwind.db
Done.

[(10248, 'VINET', 5, '1996-07-04 00:00:00', '1996-08-01 00:00:00', '1996-07-16 00:00:00', 3, 32.38, 'Vins et alcools Chevalier', '59 rue de l-Abbaye', 'Reims', None, '51100', 'France'),
 (10249, 'TOMSP', 6, '1996-07-05 00:00:00', '1996-08-16 00:00:00', '1996-07-10 00:00:00', 1, 11.61, 'Toms Spezialitten', 'Luisenstr. 48', 'Mnster', None, '44087', 'Germany'),
 (10250, 'HANAR', 4, '1996-07-08 00:00:00', '1996-08-05 00:00:00', '1996-07-12 00:00:00', 2, 65.83, 'Hanari Carnes', 'Rua do Pao, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10251, 'VICTE', 3, '1996-07-08 00:00:00', '1996-08-05 00:00:00', '1996-07-15 00:00:00', 1, 41.34, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France'),
 (10252, 'SUPRD', 4, '1996-07-09 00:00:00', '1996-08-06 00:00:00', '1996-07-11 00:00:00', 2, 51.3, 'Suprmes dlices', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium'),
 (10253, 'HANAR', 3, '1996-07-10 00:00:00', '1996-07-24 00:00:00', '1996-07-16 00:00:00', 2, 58.17, 'Hanari Carnes', 'Rua do Pao, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10254, 'CHOPS', 5, '1996-07-11 00:00:00', '1996-08-08 00:00:00', '1996-07-23 00:00:00', 2, 22.98, 'Chop-suey Chinese', 'Hauptstr. 31', 'Bern', None, '3012', 'Switzerland'),
 (10255, 'RICSU', 9, '1996-07-12 00:00:00', '1996-08-09 00:00:00', '1996-07-15 00:00:00', 3, 148.33, 'Richter Supermarkt', 'Starenweg 5', 'Genve', None, '1204', 'Switzerland'),
 (10256, 'WELLI', 3, '1996-07-15 00:00:00', '1996-08-12 00:00:00', '1996-07-17 00:00:00', 2, 13.97, 'Wellington Importadora', 'Rua do Mercado, 12', 'Resende', 'SP', '08737-363', 'Brazil'),
 (10257, 'HILAA', 4, '1996-07-16 00:00:00', '1996-08-13 00:00:00', '1996-07-22 00:00:00', 3, 81.91, 'HILARION-Abastos', 'Carrera 22 con Ave. Carlos Soublette #8-35', 'San Cristbal', 'Tchira', '5022', 'Venezuela')]

In [53]:
%%time
%%sql

CREATE VIEW CustomerOrderView AS
SELECT o.CustomerID, o.OrderID, o.OrderDate, c.CompanyName
FROM Orders o
INNER JOIN Customers c ON o.CustomerID = c.CustomerID;

 * sqlite:///Northwind.db
(sqlite3.OperationalError) view CustomerOrderView already exists
[SQL: CREATE VIEW CustomerOrderView AS
SELECT o.CustomerID, o.OrderID, o.OrderDate, c.CompanyName
FROM Orders o
INNER JOIN Customers c ON o.CustomerID = c.CustomerID;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)
Wall time: 2.84 ms

In [55]:
%%sql

SELECT * 
FROM CustomerOrderView
LIMIT 10;

 * sqlite:///Northwind.db
Done.

[('VINET', 10248, '1996-07-04', '00:00:00', 'Vins et alcools Chevalier'),
 ('TOMSP', 10249, '1996-07-05', '00:00:00', 'Toms Spezialitten'),
 ('HANAR', 10250, '1996-07-08', '00:00:00', 'Hanari Carnes'),
 ('VICTE', 10251, '1996-07-08', '00:00:00', 'Victuailles en stock'),
 ('SUPRD', 10252, '1996-07-09', '00:00:00', 'Suprmes dlices'),
 ('HANAR', 10253, '1996-07-10', '00:00:00', 'Hanari Carnes'),
 ('CHOPS', 10254, '1996-07-11', '00:00:00', 'Chop-suey Chinese'),
 ('RICSU', 10255, '1996-07-12', '00:00:00', 'Richter Supermarkt'),
 ('WELLI', 10256, '1996-07-15', '00:00:00', 'Wellington Importadora'),
 ('HILAA', 10257, '1996-07-16', '00:00:00', 'HILARION-Abastos')]

In [52]:
%%sql

DROP VIEW IF EXISTS CustomerOrderView;

CREATE VIEW CustomerOrderView AS
SELECT o.CustomerID, o.OrderID, DATE(o.OrderDate) AS OrderDateOnly, TIME(o.OrderDate) AS OrderTimeOnly, c.CompanyName
FROM Orders o
INNER JOIN Customers c ON o.CustomerID = c.CustomerID;

 * sqlite:///Northwind.db
Done.
Done.

[]

In [18]:
%sql SELECT * FROM OrderDetails LIMIT 10;

 * sqlite:///Northwind.db
Done.

[(10248, 11, 14, 12, 0.0),
 (10248, 42, 9.8, 10, 0.0),
 (10248, 72, 34.8, 5, 0.0),
 (10249, 14, 18.6, 9, 0.0),
 (10249, 51, 42.4, 40, 0.0),
 (10250, 41, 7.7, 10, 0.0),
 (10250, 51, 42.4, 35, 0.0),
 (10250, 65, 16.8, 15, 0.0),
 (10251, 22, 16.8, 6, 0.0),
 (10251, 57, 15.6, 15, 0.0)]

In [27]:
%%sql

SELECT
    OrderID,
    ProductID,
    ROUND((Quantity*UnitPrice)) AS Total_Price
FROM OrderDetails
WHERE UnitPrice IS NOT NULL
LIMIT 10;

 * sqlite:///Northwind.db
Done.

[(10248, 11, 168.0),
 (10248, 42, 98.0),
 (10248, 72, 174.0),
 (10249, 14, 167.0),
 (10249, 51, 1696.0),
 (10250, 41, 77.0),
 (10250, 51, 1484.0),
 (10250, 65, 252.0),
 (10251, 22, 101.0),
 (10251, 57, 234.0)]

In [30]:
%%sql

SELECT
    OrderID,
    ProductID,
    IF(UnitPrice < 50, 1, 0) as ExpensivePrice,
    CASE
        WHEN  (UnitPrice / Quantity)*100 < IF(UnitPrice < 50, 1, 0)
            THEN 'Low'
        WHEN (UnitPrice / Quantity)*100 > IF(UnitPrice < 50, 1, 0)
            THEN 'High'
        ELSE 'Medium'
    END AS PriceGroup
FROM OrderDetails
WHERE UnitPrice IS NOT NULL
LIMIT 10;

 * sqlite:///Northwind.db
(sqlite3.OperationalError) no such function: IF
[SQL: SELECT
    OrderID,
    ProductID,
    CASE
        WHEN  (UnitPrice / Quantity)*100 < IF(UnitPrice < 50, 1, 0)
            THEN 'Low'
        WHEN (UnitPrice / Quantity)*100 > IF(UnitPrice < 50, 1, 0)
            THEN 'High'
        ELSE 'Medium'
    END AS PriceGroup
FROM OrderDetails
WHERE UnitPrice IS NOT NULL
LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [35]:
%%sql

SELECT *
FROM Orders
WHERE ShipCity LIKE "%A%"
LIMIT 5;

 * sqlite:///Northwind.db
Done.

[(10250, 'HANAR', 4, '1996-07-08 00:00:00', '1996-08-05 00:00:00', '1996-07-12 00:00:00', 2, 65.83, 'Hanari Carnes', 'Rua do Pao, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10252, 'SUPRD', 4, '1996-07-09 00:00:00', '1996-08-06 00:00:00', '1996-07-11 00:00:00', 2, 51.3, 'Suprmes dlices', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium'),
 (10253, 'HANAR', 3, '1996-07-10 00:00:00', '1996-07-24 00:00:00', '1996-07-16 00:00:00', 2, 58.17, 'Hanari Carnes', 'Rua do Pao, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil'),
 (10257, 'HILAA', 4, '1996-07-16 00:00:00', '1996-08-13 00:00:00', '1996-07-22 00:00:00', 3, 81.91, 'HILARION-Abastos', 'Carrera 22 con Ave. Carlos Soublette #8-35', 'San Cristbal', 'Tchira', '5022', 'Venezuela'),
 (10258, 'ERNSH', 1, '1996-07-17 00:00:00', '1996-08-14 00:00:00', '1996-07-23 00:00:00', 1, 140.51, 'Ernst Handel', 'Kirchgasse 6', 'Graz', None, '8010', 'Austria')]

In [39]:
%%sql

SELECT
    CASE 
        WHEN ShipCountry IN ('Angola', 'Botswana', 'Comoros', 'Democratic Republic of Congo', 'Eswatini', 
                        'Lesotho', 'Madagascar', 'Malawi', 'Mauritius', 'Mozambique', 'Namibia', 
                        'Seychelles', 'South Africa', 'United Republic Tanzania', 'Zambia', 'Zimbabwe')
            THEN 'SADC'
            
        WHEN ShipCountry NOT IN ('Algeria', 'Libya', 'Mauritania', 'Morocco', 'Tunisia')
            THEN 'UMA'
            
        WHEN ShipCountry IN ('Benin', 'Burkina Faso', 'Cabo Verde', 'Cote dâ€™Ivoire', 'Gambia', 'Ghana', 'Guinea', 
                            'Guinea-Bissau', 'Liberia', 'Mali', 'Niger', 'Nigeria', 'Senegal', 'Sierra Leone', 'Togo')
            THEN 'ECOWAS'
            
        ELSE 'Not Classified'
    END AS Regional_economic_community,
    ShipCountry,
    ShipRegion
FROM Orders
WHERE ShipRegion LIKE "%Africa%"
LIMIT 5;

 * sqlite:///Northwind.db
Done.

[]

In [40]:
%%sql

SELECT
    MIN(OrderID) AS Min_OrderID,
    MAX(OrderID) AS Max_OrderID
FROM Orders;

 * sqlite:///Northwind.db
Done.

[(10248, 11077)]

In [42]:
%%sql

SELECT
    COUNT(DISTINCT OrderID) AS Number_of_Orders
FROM Orders;

 * sqlite:///Northwind.db
Done.

[(830,)]

In [56]:
%%sql

SELECT 
    City 
FROM 
    Customers
UNION
SELECT 
    City 
FROM 
    Employees
LIMIT 10;

 * sqlite:///Northwind.db
Done.

[(None,),
 ('Aachen',),
 ('Albuquerque',),
 ('Anchorage',),
 ('Barcelona',),
 ('Barquisimeto',),
 ('Bergamo',),
 ('Berlin',),
 ('Bern',),
 ('Boise',)]

In [48]:
%%sql

SELECT 
    c.ContactName, 
    o.OrderDate
FROM 
    Customers c
LEFT JOIN 
    Orders o
    ON c.CustomerId = o.CustomerId
LIMIT 10;

 * sqlite:///Northwind.db
Done.

[('Maria Anders', '1997-08-25 00:00:00'),
 ('Maria Anders', '1997-10-03 00:00:00'),
 ('Maria Anders', '1997-10-13 00:00:00'),
 ('Maria Anders', '1998-01-15 00:00:00'),
 ('Maria Anders', '1998-03-16 00:00:00'),
 ('Maria Anders', '1998-04-09 00:00:00'),
 ('Ana Trujillo', '1996-09-18 00:00:00'),
 ('Ana Trujillo', '1997-08-08 00:00:00'),
 ('Ana Trujillo', '1997-11-28 00:00:00'),
 ('Ana Trujillo', '1998-03-04 00:00:00')]

In [46]:
%%sql

SELECT 
    customer.ContactName, 
    customer.Country,
    SUM(orderDetails.Quantity * orderDetails.UnitPrice) AS TotalSalesAmount,
    product.ProductName,
    SUM(orderDetails.Quantity) AS TotalUnitsSold
FROM 
    Customers AS customer
JOIN 
    Orders AS orders 
    ON customer.CustomerID = orders.CustomerID
JOIN 
    OrderDetails AS orderDetails 
    ON orders.OrderID = orderDetails.OrderID
JOIN 
    Products AS product 
    ON orderDetails.ProductID = product.ProductID
WHERE 
    orders.OrderDate BETWEEN '1996-08-01' AND '1998-01-30'
GROUP BY 
    customer.ContactName,
    customer.Country, 
    product.ProductName
HAVING 
    SUM(orderDetails.Quantity * orderDetails.UnitPrice) > 5000
LIMIT 10;

 * sqlite:///Northwind.db
Done.

[('Georg Pipps', 'Austria', 10540.0, 'Cte de Blaye', 50),
 ('Horst Kloss', 'Germany', 6222.0, 'Camembert Pierrot', 194),
 ('Horst Kloss', 'Germany', 7905.0, 'Cte de Blaye', 30),
 ('Horst Kloss', 'Germany', 5268.0, 'Schoggi Schokolade', 120),
 ('Howard Snyder', 'USA', 11857.5, 'Cte de Blaye', 45),
 ('Jean Fresnire', 'Canada', 10329.2, 'Cte de Blaye', 49),
 ('Jose Pavarotti', 'USA', 6832.4400000000005, 'Thringer Rostbratwurst', 60),
 ('Jytte Petersen', 'Denmark', 10540.0, 'Cte de Blaye', 50),
 ('Lcia Carvalho', 'Brazil', 8432.0, 'Cte de Blaye', 40),
 ('Patricia McKenna', 'Ireland', 5830, 'Raclette Courdavault', 112)]

## Avoid using the wildcard (`%`) at the beginning of a `LIKE` operator
#Random SQL tip!<br>
Example : Do WHERE TailNum LIKE 'N7%' instead of WHERE TailNum LIKE '%N7%'